In [2]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
Q1. List any five functions of the pandas library with execution.

In [35]:
#1) Dataframe
df=pd.DataFrame({'name':['Anjali',"Moni","Rohit"],
                "id":[2,6,8],
                "address":["Kaithal","Jind","Rohtak"]}
               )
df

     name  id  address
0  Anjali   2  Kaithal
1    Moni   6     Jind
2   Rohit   8   Rohtak

In [36]:
# 2)Series
df=pd.Series({'name':['Anjali',"Moni","Rohit"],
                "id":[2,6,8],
                "address":["Kaithal","Jind","Rohtak"]}
               )
df

name         [Anjali, Moni, Rohit]
id                       [2, 6, 8]
address    [Kaithal, Jind, Rohtak]
dtype: object

In [37]:
# 3)
pd.cut([0, 1, 1, 2], bins=3)

[(-0.002, 0.667], (0.667, 1.333], (0.667, 1.333], (1.333, 2.0]]
Categories (3, interval[float64, right]): [(-0.002, 0.667] < (0.667, 1.333] < (1.333, 2.0]]

In [38]:
# 4)
s1=[1,2,3,4]
s2=[2,4,5,6]
df1=pd.Series(s1)
df2=pd.Series(s2)
pd.concat([df1,df2])

0    1
1    2
2    3
3    4
0    2
1    4
2    5
3    6
dtype: int64

In [39]:
# 5)
pd.unique(pd.Series([2, 1, 3, 3,5,5,9,0,9,3,5]))

array([2, 1, 3, 5, 9, 0])

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [40]:
df=pd.DataFrame({'A':[1,2,3,4],'B':[3,5,6,5],'C':[3,6,7,8]})
df

   A  B  C
0  1  3  3
1  2  5  6
2  3  6  7
3  4  5  8

In [41]:
df=pd.DataFrame({'A':[1,2,3,4],'B':[3,5,6,5],'C':[3,6,7,8]},index=[1,3,5,7])
df

   A  B  C
1  1  3  3
3  2  5  6
5  3  6  7
7  4  5  8

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [42]:
df=pd.DataFrame({"Value":[10, 20, 30, 40, 50]})
df

   Value
0     10
1     20
2     30
3     40
4     50

In [43]:
value=df.head(3)
value.sum()

Value    60
dtype: int64

In [ ]:

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [44]:
def add_word_count(df, column_name):
    # Split the text into words and count the number of words
    word_count = df[column_name].str.split().apply(len)
    
    # Add the 'Word_Count' column to the DataFrame
    df['Word_Count'] = word_count
    
    # Return the updated DataFrame
    return df
# Create a sample DataFrame
data = {'Text': ['This is a sample sentence.',
                 'Another sentence with more words.',
                 'One word.',
                 ''],
        }
df = pd.DataFrame(data)

# Call the function to add the 'Word_Count' column
df = add_word_count(df, 'Text')

# Print the updated DataFrame
print(df)

                                Text  Word_Count
0         This is a sample sentence.           5
1  Another sentence with more words.           5
2                          One word.           2
3                                              0

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [45]:
df=pd.DataFrame({"Text":["Priyanka","Amrita","Sohini","Sonalika"]})
df

       Text
0  Priyanka
1    Amrita
2    Sohini
3  Sonalika

size

In [ ]:
size tell about number of rows

In [5]:

df.size

4

Shape

In [ ]:
shape tell about number of rows and columns

In [6]:

df.shape

(4, 1)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

In [ ]:
Answer:
    we use pd.read_excel("filename.xlsx") to read excel file.

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [46]:
p=pd.DataFrame({"email_id":['Anjali@gmail.com','rohit@gmail.com','divya@gmail.com','Priya@gmail.com']})
p

           email_id
0  Anjali@gmail.com
1   rohit@gmail.com
2   divya@gmail.com
3   Priya@gmail.com

In [47]:
def extract_username(p):
    p['Username'] = p['email_id'].str.split('@').str[0]
    return p
p = extract_username(p)
p

           email_id Username
0  Anjali@gmail.com   Anjali
1   rohit@gmail.com    rohit
2   divya@gmail.com    divya
3   Priya@gmail.com    Priya

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [48]:
DF=pd.DataFrame({"A":[1,2,7,8,3,5],"B":[2,3,4,5,6,8],"C":[0,9,4,3,12,7]})
DF

   A  B   C
0  1  2   0
1  2  3   9
2  7  4   4
3  8  5   3
4  3  6  12
5  5  8   7

In [49]:
DF[(DF["A"]>5) &( DF["B"]<10)]

   A  B  C
2  7  4  4
3  8  5  3

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [4]:
a=pd.DataFrame({"value":[78,56,89,45,23,90,807,99,500,67]})
a

   value
0     78
1     56
2     89
3     45
4     23
5     90
6    807
7     99
8    500
9     67

In [5]:
a.mean()

value    185.4
dtype: float64

In [7]:
a.median()

value    83.5
dtype: float64

In [8]:
a.std()

value    258.113326
dtype: float64

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [32]:


def calculate_moving_average(df):
    # Sort the DataFrame by date in ascending order
    df = df.sort_values('Date')
    
    # Calculate the moving average using a window of size 7
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    # Return the updated DataFrame
    return df

# Create a sample DataFrame
data = {'Sales': [10, 20, 15, 25, 30, 35, 40, 50, 45, 55],
        'Date': pd.date_range(start='2023-01-01', periods=10)}
df = pd.DataFrame(data)

# Call the function to calculate the moving average
df = calculate_moving_average(df)

# Print the updated DataFrame
df

   Sales       Date  MovingAverage
0     10 2023-01-01      10.000000
1     20 2023-01-02      15.000000
2     15 2023-01-03      15.000000
3     25 2023-01-04      17.500000
4     30 2023-01-05      20.000000
5     35 2023-01-06      22.500000
6     40 2023-01-07      25.000000
7     50 2023-01-08      30.714286
8     45 2023-01-09      34.285714
9     55 2023-01-10      40.000000

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [29]:
df=pd.DataFrame({"Date":["2023-01-01",'2023-01-02','2023-01-03','2023-01-04','2023-01-05','2023-01-06']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06

In [30]:
df["Weekday"]=["Sunday","Monday","Tuesday","Wednesday","Thrusday","Friday"]
df

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thrusday
5  2023-01-06     Friday